=============== KẾ HOẠCH CẮT SẮT TỐI ƯU ===============
Chiều dài cây sắt: 6000

 470mm  460mm  445mm  430mm  425mm  190mm  25mm  Hao hụt  SL cây sắt
     1      1      8      1      2      1     1        0         319
     2      1      0      7      0      8     2        0         306
     4      0      4      4      1      0     7        0         130
     6      6      0      0      0      2     1        0         111
     4      1      1      2      5      1     1        0         107
     7      2      0      0      3      1    12        0          94
     0      4      5      1      3      1     1        0           2
     2      2      4      3      0      5     4        0           1
     1      4      3      0      5      1     1        0           1
     0      4      4      0      4      2    11        0           1


📊 BẢNG TỔNG KẾT SẢN XUẤT:
 Đoạn (mm)  SL cần (đoạn)  SL cắt (đoạn)  Tồn kho (đoạn)
       470           3200           3206               6
       460           1600           1604               4
       445           3200           3200               0
       430           3200           3200               0
       425           1600           1600               0
       190           3200           3200               0
        25           3200           3205               5

---------------------------------------------------------
Tổng số cây sắt 6000 cần dùng: 1072 
Tổng số đoạn sản xuất được:      19215
Tổng lượng sắt hao hụt cuối cùng: 0.0m
Hao hụt: 0.00%
=========================================================